[
  [
    {
      "summary": "SUN Mobility is an electric vehicle energy services company founded in 2017. It develops, manufactures, and operates battery swapping infrastructure for electric two-wheelers, three-wheelers, and larger commercial vehicles. The company is a joint venture between the SUN Group and the Maini Group, co-founded by Chetan Maini, Uday Khemka, and Ajay Goel. Anant Badjatya is the current CEO of the India business. SUN Mobility has over 600 battery swapping points across India and has partnerships with various fleet operators, shared mobility service providers, and automotive OEMs.",
      "error": false
    },
    {
      "summary": "In 2019, Bosch invested $25 million in SUN Mobility and has since been a technology partner. Vitol, a Dutch oil trading organization, invested $50 million in 2021. In 2023, SUN Mobility began international operations with Shell as a partner in the Philippines.",
      "error": false
    },
    {
      "summary": "SUN Mobility's battery swapping technology addresses common roadblocks to electric vehicle adoption such as high up-front costs, range anxiety, battery management concerns, and battery pack obsolescence. The company offers Battery-as-a-Service (BaaS) and Mobility-as-a-Service (MaaS) solutions. SUN Mobility operates over 600 battery swapping points across India and has a leading market share in e-auto and e-loader categories, the highest market share in swappable e-bikes, and about 50% market share in e-rickshaws in northern India.",
      "error": false
    },
    {
      "summary": "SUN Mobility provides modular Smart Batteries that are smaller and lighter than conventional fixed EV batteries and are swappable in a few minutes. The second-generation Smart battery S2.1 was launched at the Delhi Auto Expo in January 2023. The SwapX is a battery swapping station developed by SUN Mobility to improve the density of the battery swapping network. It was launched in January 2023 at the Delhi Auto Expo and comes with 3 docks.",
      "error": false
    },
    {
      "summary": "SUN Mobility has partnered with fleet operators such as Amazon, Zomato, and Swiggy, shared mobility service providers, and automotive OEMs like Omega Seiki Mobility, Hero Electric, Piaggio Vehicles Pvt. Ltd., and others. The company has also collaborated with energy infrastructure players, electricity distribution companies, and city transport corporations such as Indian Oil Corporation, Delhi Metro Rail Corporation, and Tata Power Delhi Distribution Limited to expand their network across urban India.",
      "error": false
    }
  ],
  [
    {
      "summary": "The content includes navigation links to different sections of the Google Play Store such as Games, Apps, Movies, Books, and Kids. It also includes links to user account settings, privacy policy, and terms of service.",
      "error": false
    },
    {
      "summary": "The SUN Mobility Driver App is designed to help drivers monitor the State of Charge of Electric Vehicles powered by SUN Mobility's Smart Battery system. It also assists in locating nearby SUN Mobility Quick Interchange Stations for battery swaps and displays swap transactions for the vehicle.",
      "error": false
    },
    {
      "summary": "The app has a rating of 3.8 stars with 225 reviews and over 50,000 downloads. It is rated for users aged 3 and above.",
      "error": false
    },
    {
      "summary": "The app includes screenshots showcasing its features and user interface.",
      "error": false
    },
    {
      "summary": "The app provides information on data safety, including that no data is shared with third parties and that personal information is encrypted in transit. Users can request data deletion.",
      "error": false
    },
    {
      "summary": "The app has received mixed reviews, with some users reporting issues such as problems with recharging, poor customer service, and inaccurate information displayed by the app.",
      "error": false
    },
    {
      "summary": "The latest update to the app includes Firebase Configuration.",
      "error": false
    },
    {
      "summary": "Support information for the app includes a website, support email, and privacy policy. The developer information includes the names of the developers, email, and physical address.",
      "error": false
    },
    {
      "summary": "Other apps by Sun Mobility include SM Fleet Driver App, SUNM - DTL EV INFRA, SUN Mobility Service App, SM ESV App, and SUN Mobility Agent App.",
      "error": false
    },
    {
      "summary": "Additional links and information about Google Play, including Play Pass, Play Points, Gift cards, Redeem, Refund policy, Kids & family, Terms of Service, Privacy, About Google Play, Developers, and Google Store.",
      "error": false
    }
  ],
  [
    {
      "summary": "SUN Mobility offers a 'pay-as-you-go' model for electric vehicles (EVs) by separating the battery from the vehicle, addressing issues like high upfront costs, range anxiety, and long refueling times. The company provides innovative technologies for battery swapping solutions, including smart batteries, quick interchange stations, smart networks, and plug-and-play docks.",
      "error": false
    },
    {
      "summary": "SUN Mobility has received several awards and recognitions, including the Technology Excellence Award, Global CleanTech 100, Entrepreneurship World Cup, APAC 25, CleanEquity Monaco, and GABS Innovator Award. These awards highlight the company's contributions to the field of EVs and technology.",
      "error": false
    },
    {
      "summary": "SUN Mobility has made significant strides in promoting clean mobility, with over 630 active swap stations, covering approximately 30 million emission-free kilometers monthly, and saving around 56,000 metric tonnes of CO2 emissions so far.",
      "error": false
    },
    {
      "summary": "SUN Mobility provides a seamless driver experience, as evidenced by testimonials from drivers like Deepu in Chandigarh, who have seen significant improvements in their daily operations and earnings due to the company's battery swapping technology.",
      "error": false
    },
    {
      "summary": "SUN Mobility offers various ways to get in touch, including email addresses for enquiries, partnerships, PR & media, and complaints. The company is headquartered in Bangalore, Karnataka, India, and provides a toll-free number for customer support.",
      "error": false
    },
    {
      "summary": "SUN Mobility provides a partnership enquiry form for individuals or companies interested in partnering with them. The form includes fields for personal and company details, address information, past experience, ownership or operation details, power availability, and investment amount.",
      "error": false
    }
  ],
  [
    {
      "summary": "SUN Mobility and IndianOil have announced a joint venture to establish over 10,000 battery swapping stations across more than 40 cities in India by 2030. This initiative aims to facilitate the adoption of electric mobility for two-wheelers, three-wheelers, and small four-wheelers through a convenient 'Battery as a Service' (BaaS) model. The partnership leverages IndianOil's extensive network of fuel stations and SUN Mobility's advanced battery swapping technology to streamline the EV experience by addressing concerns related to battery cost, maintenance, replacement, and charging time.",
      "error": false
    }
  ],
  [
    {
      "summary": "The article discusses the partnership between SUN Mobility and IndianOil to revolutionize EV charging through battery swapping. This collaboration aims to create a vast network of battery-swapping stations across India, making EV charging as accessible as conventional fuel stations. The initiative addresses challenges such as long charging times, high upfront costs, and environmental concerns. The partnership plans to scale up to 10,000 stations across more than 40 cities within the next three years, supporting electric two-wheelers, three-wheelers, and small four-wheelers.",
      "error": false
    }
  ],
  [
    {
      "summary": "SUN Mobility is a company focused on making electric vehicles (EVs) accessible and affordable for all. It is a joint venture between the Maini Group and SUN Group, co-founded by Chetan Maini and Uday Khemka. The company aims to accelerate the adoption of electric mobility with innovative battery swapping technology, which is designed to be universally interoperable across various vehicle platforms. SUN Mobility's technology includes state-of-the-art Smart Batteries and a vast network of IoT-enabled Swap Points, addressing issues like high upfront cost, range anxiety, and long charging times. The company collaborates with various industry players, including vehicle manufacturers, battery cell technology providers, fleet operators, and ride-sharing players, to lead the EV revolution.",
      "error": false
    },
    {
      "summary": "SUN Mobility is based in Bangalore, Karnataka, and has 501-1,000 employees. The company was founded in 2017 and is privately held. It operates in the renewable energy equipment manufacturing industry. The primary location is in Bangalore, Karnataka 560048, IN.",
      "error": false
    },
    {
      "summary": "Key employees at SUN Mobility include Ajay Goel (Managing Director | CEO), Karthee Madasamy (Early Stage deep tech VC @ MFV Partners | Independent Director, MapMyIndia | ex-MD, Qualcomm Ventures), Dharmendra Pundeer (Head Software Delivery And Operations), and Subhash Bhat (CFO).",
      "error": false
    },
    {
      "summary": "SUN Mobility is a company focused on electric mobility solutions. They have partnered with Greaves Electric Mobility and IndoFast Energy to supercharge over 50,000 Ampere Electric Vehicles with battery swapping in India. The company aims to make electric mobility seamless, affordable, and hassle-free, especially for gig workers and last-mile delivery riders. They also have an expanding battery-swapping network to reduce downtime and unlock new possibilities for EV adoption at scale. The future of urban mobility is electric, and SUN Mobility is making it easier than ever with their innovative solutions.",
      "error": false
    },
    {
      "summary": "SUN Mobility's Chairman, Chetan Maini, delivered a keynote at the Deccan Herald Bengaluru 2040 Summit, highlighting how technology, sustainability, and collaboration will shape urban mobility. With 1 in 2 scooters sold in Bangalore already electric, the transition to clean energy is well underway. The discussions reinforced Bangalore’s role as a hub for innovation and sustainability, and SUN Mobility is excited to be part of this journey, accelerating India’s transition to smarter, cleaner mobility.",
      "error": false
    },
    {
      "summary": "SUN Mobility has expanded its battery swapping services to Jaipur, introducing a new 4-station battery swapping site in Adarsh Nagar, powered by IndoFast Energy. This is just the beginning of their plans for Jaipur, with more expansions in the near future. They aim to revolutionize urban mobility together, one swap at a time.",
      "error": false
    },
    {
      "summary": "SUN Mobility introduced their Full-Service Partner (FSP) model at the Federation of Automobile Dealers Associations (FADA) Auto Summit 2025 in New Delhi. This model provides partners with end-to-end support, ensuring seamless setup, operations, and long-term profitability. With an ROI of 15%+ on an investment of ₹2-10 Cr, this initiative aims to empower businesses and entrepreneurs by simplifying the adoption of battery-swapping technology.",
      "error": false
    },
    {
      "summary": "SUN Mobility has been recognized with the prestigious “Championship of Disruptive Innovation” award by the Global IP Convention (GIPC) Awards. This recognition reaffirms their commitment to sustainability through cutting-edge technology and innovative solutions. Their journey of innovation has seen a growth from 18 intellectual properties (IPs) in 2018 to over 250 IPs by 2024, showcasing their relentless pursuit of excellence and dedication to redefining the energy and mobility landscape.",
      "error": false
    },
    {
      "summary": "SUN Mobility celebrated the new year with a focus on clean, unpolluted air and sustainability. They encourage everyone to choose electric mobility and wish everyone a happy Pongal, Lohri, and Makar Sankranti. The company is committed to building a sustainable future and driving change through innovative solutions.",
      "error": false
    },
    {
      "summary": "SUN Mobility's Chairman, Chetan Maini, has been a pioneer in India's electric vehicle journey, from the Reva electric car to founding SUN Mobility. He has been at the forefront of the EV revolution, shaping the industry with his vision and innovations. His latest venture, SUN Mobility, aims to accelerate the adoption of electric vehicles through battery swapping and sustainable mobility solutions.",
      "error": false
    },
    {
      "summary": "The Union Minister of Commerce and Industry, Piyush Goyal, has outlined a transformative vision for India’s energy landscape, integrating battery swapping and EV charging infrastructure into the expansive network of petrol pumps and CNG stations. This initiative aims to make sustainable mobility accessible, boosting EV adoption and aligning with India's climate targets. SUN Mobility is part of this vision, working towards a future-ready energy ecosystem.",
      "error": false
    },
    {
      "summary": "SUN Mobility celebrated the new year with gratitude to their customers, partners, investors, and team. They are committed to building a sustainable future and driving change through innovative solutions. The company is excited about the future of electric mobility and the impact they can make together.",
      "error": false
    }
  ]
]