[
  [
    {
      "summary": "The Indus Script is an ancient writing system used by the Indus Valley Civilization, which flourished around 2600-1900 BCE. The script remains undeciphered, and its exact nature and purpose are subjects of ongoing research. The script is found on various artifacts, including seals, pottery, and copper tablets, and is characterized by its pictographic and logographic elements. Despite numerous attempts, no consensus has been reached on its decipherment, making it one of the most enigmatic writing systems in history.",
      "error": false
    }
  ],
  [
    {
      "summary": "The Indus script is an ancient writing system associated with the Indus Valley Civilization, which flourished around 2600-1900 BCE. It is known for its unique symbols and remains undeciphered, making it one of the most enigmatic scripts in history. The script is found on various artifacts such as seals, tablets, and pottery, and its decipherment has been a subject of extensive research and debate.",
      "error": false
    },
    {
      "summary": "The Indus script, also known as the Harappan script, is a writing system developed by the Indus Valley Civilization. It is one of the earliest forms of writing in the world, with proto-Indus writing on shards of pottery dating back to 3500 BCE. The script has been found on various artifacts, including 1540 from Mohenjodaro, 985 from Harappa, and 66 from Chanhudaro. The script is characterized by its pictographic nature, with signs often depicting animals, objects, and abstract symbols. The commonly depicted 'unicorn' is likely a bull drawn in profile. The script has been a subject of extensive study, with various theories about its origin and language. Some scholars suggest it is related to Dravidian languages, while others propose different linguistic affiliations. The script remains undeciphered, and efforts to decode it continue, including the use of machine learning and computational linguistics.",
      "error": false
    },
    {
      "summary": "The content includes a list of works cited related to the Indus script, covering various scholarly articles, books, and research papers. The works span a wide range of topics, including archaeological findings, linguistic analyses, and historical interpretations of the Indus script. Notable authors include F. Raymond Allchin, Steven C. Bonta, Edwin Francis Bryant, Alexander Cunningham, Michael Everson, Steve Farmer, Richard Sproat, Michael Witzel, Walter Ashlin Fairservis, Amalananda Ghosh, Jack Goody, Henry Heras, G. R. Hunter, Iravatham Mahadevan, John Marshall, Richard H. Meadow, Jonathan Mark Kenoyer, Yuri Knorosov, Franciscus Bernardus Jacobus Kuiper, Braj Basi Lal, Andrew Lawler, Asko Parpola, Gregory L. Possehl, Himanshu Prabha Ray, Shikaripur Ranganath Rao, Rajesh P. N. Rao, Andrew Robinson, Sailendra Nath Sen, Richard Sproat, E. Sreedharan, William H. Jr. Stiebing, B. K. Wells, Michael Witzel, Rita P. Wright, and Kamil Zvelebil.",
      "error": false
    },
    {
      "summary": "The Indus script remains undeciphered despite numerous attempts. There is no established scholarly consensus on its meaning. Key points of agreement include the right-to-left direction of inscriptions, the numerical nature of certain signs, and the functional homogeneity of terminal signs. Over 100 attempts at decipherment have been made since the 1920s, with the topic being popular among amateur researchers. In 2025, a $1 million prize was announced for deciphering the script.",
      "error": false
    },
    {
      "summary": "The Indus script's 'fish sign' has been interpreted as a homophone for 'star' using the rebus principle. Some scholars argue that the script recorded an early form of Dravidian languages, with early proponents including Henry Heras. Yuri Knorozov and Asko Parpola suggested a Dravidian language as the underlying language. Rajesh P. N. Rao's computational analysis supports the script's syntactic structure and similarity to Old Tamil.",
      "error": false
    },
    {
      "summary": "The most influential proponent of the Indo-Aryan hypothesis is Shikaripura Ranganatha Rao, who claimed to have deciphered the script. However, his interpretation is controversial and has been criticized for lacking evidence of affixes or inflectional endings. The script's lack of cultural similarities with Indo-European cultures further weakens this hypothesis.",
      "error": false
    },
    {
      "summary": "A less popular hypothesis suggests the Indus script belongs to the Munda family of languages, spoken in central and eastern India. However, the reconstructed vocabulary of early Munda does not reflect Harappan culture, making it an unlikely candidate for the language of the Indus Civilisation.",
      "error": false
    },
    {
      "summary": "An opposing hypothesis is that the Indus symbols are nonlinguistic signs representing families, clans, gods, and religious concepts. Arguments for this include the extreme brevity of inscriptions, the existence of too many rare signs, and the lack of sign repetition typical of language. However, scholars like Asko Parpola and Rajesh P. N. Rao have challenged this view, presenting evidence for the script's linguistic nature.",
      "error": false
    },
    {
      "summary": "The Indus symbols have been assigned the ISO 15924 code 'Inds'. A proposal for encoding the script in Unicode's Supplementary Multilingual Plane was submitted in 1999 but has not been approved. The Indus Script Font, developed based on a corpus compiled by Asko Parpola, is a Private Use Areas font representing the Indus script.",
      "error": false
    },
    {
      "summary": "The Indus Valley Civilization started to decline around 1800 BCE, marking the disappearance of writing. The script created by the Indus Valley Civilization perished along with it. The Vedic civilization, which ruled over North India for several centuries, did not use the Indus Script or have a writing system.",
      "error": false
    },
    {
      "summary": "Further reading on the Indus script includes various scholarly articles and books. Notable works include 'On the Most Frequently Used Symbol in the Indus Script' by B. B. Lal, 'Murukan In the Indus Script' by Iravatham Mahadevan, and 'Aryan or Dravidian or Neither? A Study of Recent Attempts to Decipher the Indus Script (1995–2000)' by Iravatham Mahadevan. Other significant works include 'Towards a Scientific Study of the Indus Script' by Iravatham Mahadevan, 'Ancient Tax Tokens, Trade Licenses and Metrological Records?: Making Sense of Indus Inscribed Objects Through Script-Internal, Contextual, Linguistic, and Ethnohistorical Lenses' by Bahata Ansumali Mukhopadhyay, and 'Metal-smithy, Bead-making, Jeweler's weight, Trade-permit, Tax-stamp: Indus Script's Semasiography Partly Decoded' by Bahata Ansumali Mukhopadhyay. Additionally, there are works by Asko Parpola and others on the Corpus of Indus seals and inscriptions.",
      "error": false
    },
    {
      "summary": "Indus Valley sites in Pakistan include Harappa, Larkana, Mohenjo-daro, Nausharo, Chanhudaro, Ganweriwal, Mehrgarh, Lakhueen-jo-daro, Pirak, Kot Bala, Kot Diji, Rehman Dheri, Amri, Sutkagan Dor, Sokhta Koh, Tharro Hills, Pir Shah Jurio, Allahdino, Balakot, Ganeriwala, Nindowari, Judeir-jo-daro, and Dabarkot.",
      "error": false
    },
    {
      "summary": "Indus Valley sites in India include Dholavira, Gola Dhoro, Lothal, Bhagatrav, Rangpur, Jognakhera, Surkotada, Kalibangan, Manda, Alamgirpur, Daimabad, Malwan, Kunal, Rakhigarhi, Rupnagar, Rupar, Hulas, Kanmer, Oriyo timbo, Dher Majra, Lohari Ragho, Dwarka, Kuntasi, Loteshwar, Mandi, Farmana, Ganeshwar, Sothi, Siswal, Sanauli, Sanghol, Pabumath, Nagwada, Babar Kot, Balu, Bara, Bargaon, Bhagwanpura, Bhirrana, Banawali, Rojdi, Kotla Nihang Khan, Kerala-no-dhoro, Mitathal, and Desalpur.",
      "error": false
    },

    {
      "summary": "The Indus script, also known as the Harappan script and the Indus Valley script, is a corpus of symbols produced by the Indus Valley Civilisation. Most inscriptions containing these symbols are extremely short, making it difficult to judge whether or not they constituted a writing system used to record a Harappan language. Despite many attempts, the script has not yet been deciphered. There is no known bilingual inscription to help decipher the script, which shows no significant changes over time. However, some of the syntax varies depending upon location. The first publication of a seal with Harappan symbols dates to 1875, and by 1992, an estimated 4,000 inscribed objects had been discovered, with over 400 distinct signs represented across known inscriptions.",
      "error": false
    },
    {
      "summary": "Some scholars, such as G. R. Hunter, S. R. Rao, John Newberry, and Krishna Rao, have argued that the Brahmi script has some connection with the Indus system. Raymond Allchin has somewhat cautiously supported the possibility of the Brahmi script being influenced by the Indus script. Another possibility for the continuity of the Indus tradition is in the megalithic graffiti symbols of southern and central India and Sri Lanka, which probably do not constitute a linguistic script but may have some overlap with the Indus symbol inventory. Linguists such as Iravatham Mahadevan, Kamil Zvelebil, and Asko Parpola have argued that the script had a relation to a Dravidian language.",
      "error": false
    },
    {
      "summary": "The Indus script symbols have primarily been found on stamp seals, pottery, bronze, and copper plates, tools, and weapons. The majority of the textual corpus consists of seals, impressions of such seals, and graffiti markings inscribed on pottery. Seals and their impressions were typically small in size and portable, with most being just 2–3 centimetres in length on each side. No extant examples of the Indus script have been found on perishable organic materials like papyrus, paper, textiles, leaves, wood, or bark.",
      "error": false
    },
    {
      "summary": "Early examples of the Indus script have been found on pottery inscriptions and clay impressions of inscribed Harappan seals dating to around c. 2800–2600 BCE during the Early Harappan period, and emerging alongside administrative objects such as seals and standardised weights during the Kot Diji phase of this period. Excavations at Harappa have demonstrated the development of some symbols from potter's marks and graffiti belonging to the earlier Ravi phase from c. 3500–2800 BCE.",
      "error": false
    },
    {
      "summary": "In the Mature Harappan period, from about c. 2600–1900 BCE, strings of Indus signs are commonly found on flat, rectangular stamp seals as well as written or inscribed on a multitude of other objects including pottery, tools, tablets, and ornaments. Signs were written using a variety of methods including carving, chiselling, embossing, and painting applied to diverse materials such as terracotta, sandstone, soapstone, bone, shell, copper, silver, and gold. As of 1977, Iravatham Mahadevan noted that about 90% of the Indus script seals and inscribed objects discovered so far were found at sites in Pakistan along the Indus River and its tributaries, such as Mohenjo-daro and Harappa, while other sites located elsewhere account for the remaining 10%. Often, animals such as bulls, water buffaloes, elephants, rhinoceros, and the mythical 'unicorn' accompanied the text on seals, possibly to help the illiterate identify the origin of a particular seal.",
      "error": false
    },
    {
      "summary": "The Late Harappan period, from c. 1900–1300 BCE, followed the more urbanised Mature Harappan period, and was a period of fragmentation and localisation which preceded the early Iron Age in the Indian subcontinent. Inscriptions have been found at sites associated with the localised phases of this period. At Harappa, the use of the script largely ceased as the use of inscribed seals ended around c. 1900 BCE; however, the use of the Indus script may have endured for a longer duration in other regions such as at Rangpur, Gujarat, particularly in the form of graffiti inscribed on pottery. Seals from the Jhukar phase of the Late Harappan period, centred on the present-day province of Sindh in Pakistan, lack the Indus script, however, some potsherd inscriptions from this phase have been noted. Both seals and potsherds bearing Indus script text, dated c. 2200–1600 BCE, have been found at sites associated with the Daimabad culture of the Late Harappan period, in present-day Maharashtra.",
      "error": false
    },
    {
      "summary": "Numerous artefacts, particularly potsherds and tools, bearing markings inscribed into them have been found in Central India, South India, and Sri Lanka dating to the Megalithic Iron Age which followed the Late Harappan period. These markings include inscriptions in the Brahmi and Tamil-Brahmi scripts, but also include non-Brahmi graffiti symbols which co-existed contemporaneously with the Tamil-Brahmi script. As with the Indus script, there is no scholarly consensus on the meaning of these non-Brahmi symbols. Some scholars, such as the anthropologist Gregory Possehl, have argued that the non-Brahmi graffiti symbols are a survival and development of the Indus script into and during the 1st millennium BCE. In 1960, archaeologist B. B. Lal found that a majority of the megalithic symbols he had surveyed were identifiably shared with the Indus script, concluding that there was a commonness of culture between the Indus Valley Civilisation and the later Megalithic period. Similarly, Indian epigraphist Iravatham Mahadevan has argued that sequences of Megalithic graffiti symbols have been found in the same order as those on comparable Harappan inscriptions and that this is evidence that language used by the Iron Age people of south India was related to or identical with that of the late Harappans.",
      "error": false
    },
    {
      "summary": "The characters are largely pictorial, depicting objects found in the ancient world generally, found locally in Harappan culture, or derived from the natural world. However, many abstract signs have also been identified. Some signs are compounds of simpler pictorial signs, while others are not known to occur in isolation, being known only to occur as components of more complex signs. Some signs resemble tally marks and are often interpreted as early numerals. The number of principal signs is over 400, which is considered too large a number for each character to be a phonogram, and so the script is generally believed to be logo-syllabic. The precise total number of signs is uncertain, as there is disagreement concerning whether particular signs are distinct or variants of the same sign. In the 1970s, the Indian epigrapher Iravatham Mahadevan published a corpus and concordance of Indus inscriptions listing 419 distinct signs in specific patterns. However, in 2015, the archaeologist and epigrapher Bryan Wells estimated that there were around 694 distinct signs. Of the signs identified by Mahadevan, 113 occur only once, 47 occur only twice, and 59 occur fewer than five times. Just 67 signs account for 80 percent of usage across the corpus of Indus symbols. The most frequently used sign is the 'jar' sign, identified by Parpola as 'sign 311'.",
      "error": false
    },
    {
      "summary": "Most scholars agree that the Indus script was generally read from right to left, though some exceptions wherein the script is written left to right or in a boustrophedon mode are also known. Although the script is undeciphered, the writing direction has been deduced from external evidence, such as instances of the symbols being compressed on the left side as if the writer is running out of space at the end of the row. In the case of seals, which create a mirror image impression on the clay or ceramic on which the seal is affixed, the impression of the seal is read from right to left, as is this case with inscriptions in other cases.",
      "error": false
    },
    {
      "summary": "Some researchers have sought to establish a relationship between the Indus script and Brahmi, arguing that it is a substratum or ancestor to later writing systems used in the region of the Indian subcontinent. Others have compared the Indus script to roughly contemporary pictographic scripts from Mesopotamia and the Iranian plateau, particularly Sumerian proto-cuneiform and Elamite scripts. However, researchers now generally agree that the Indus script is not closely related to any other writing systems of the second and third millennia BCE, although some convergence or diffusion with Proto-Elamite conceivably may be found. A definite relationship between the Indus script and any other script remains unproven.",
      "error": false
    },
    {
      "summary": "Researchers have compared the Indus Valley script to the Brahmi and Tamil-Brahmi scripts, suggesting that there may be similarities between them. These similarities were first suggested by early European scholars, such as the archaeologist John Marshall and the Assyriologist Stephen Langdon, with some, such as G. R. Hunter, proposing an indigenous origin of Brahmi with a derivation from the Indus script.",
      "error": false
    },
    {
      "summary": "Researchers have also compared the Indus Valley script with the Proto-Elamite script used in Elam, an ancient Pre-Iranian civilisation that was contemporaneous with the Indus Valley civilisation. Their respective scripts were contemporary to each other, and both were largely pictographic. About 35 Proto-Elamite signs may possibly be comparable to Indus signs. Writing in 1932, G. R. Hunter argued, against the view of Stephen Langdon, that the number of resemblances 'seem to be too close to be explained by coincidence'.",
      "error": false
    },
    {
      "summary": "The following factors are usually regarded as the biggest obstacles to successful decipherment: Inscriptions are very short. The average length of the inscriptions is around five signs, and the longest only 34 characters long, found on a copper plate belonging to the mature Harappan period. Inscriptions vary between just one and seven lines, with single lines being the most common. 67 signs account for 80 percent of the writing that has been identified. There are doubts whether the Indus script records a written language or is instead a system of non-linguistic signs or proto-writing similar to merchant's marks and house marks, and to the contemporary accounting tokens and numerical clay tablets of Mesopotamia. Due to the brevity of inscriptions, some researchers have questioned whether Indus symbols can even express a spoken language. The spoken Harappan language has not been identified, so, assuming the script is a written language, the language the script is most likely to express is unknown. However, an estimated 300 loanwords in the Rigveda may provide evidence of substrate language(s) which may have been spoken in the region of the Indus civilisation. No digraphic or bilingual texts, like the Rosetta Stone, have been found. No names, such as those of Indus rulers or personages, are known to be attested in surviving historical records or myths, as was the case with rulers like Rameses and Ptolemy, who were known to hieroglyphic decipherers from records attested in Greek.",
      "error": false
    }
  ],
  [
    {
      "summary": "The subreddit r/Dravidiology is dedicated to the scientific study of Dravidian people, language, genetics, culture, kinship systems, and history. It supports verifiable evidence and peer-reviewed research. The subreddit has ongoing projects to update Wiktionary with Dravidian etymologies, update the Swadesh list of all Dravidian languages, and work towards an updated DED revision 3.",
      "error": false
    },
    {
      "summary": "A post by user Disastrous-Silver-16 discusses a surprising revelation in Indic studies. Yajnavedam, a US-based cryptographer and engineer, has decoded the Indus script using cryptographic techniques, suggesting that Sanskrit (Samskruta) is the language of the ancient Indus Valley. This finding offers a deeper link to Indic heritage. The post includes links to a video and a paper detailing Yajnavedam's work.",
      "error": false
    }
  ],
  [
    {
      "summary": "The Indus Valley Script, also known as the Harappan script, is a pictographic script developed during the Indus Valley Civilisation. It is one of the oldest forms of writing from the Indian subcontinent, consisting of various signs and symbols. The script is boustrophedon, meaning it is written right to left in one line and then left to right in the preceding line. The script might have been developed between 3500 BC and 2700 BC. It has been found on various objects such as seals, pottery, and bronze tools. The script is believed to have had an administrative function, possibly used for recording transactions. Despite extensive research, the script remains undeciphered due to the lack of bilingual texts and the perishable nature of the materials on which it was written.",
      "error": false
    },
    {
      "summary": "The Indus script is boustrophedon, with examples of bidirectional writing. Certain numerical values have been identified, with a single unit represented by a downward stroke and semicircles for units of 10. The script combines word signs and symbols with phonetic values, making it a logo-syllabic writing system. By 1800 BCE, the Indus Valley Civilization was in decline, and the script eventually disappeared with the civilization.",
      "error": false
    },
    {
      "summary": "Pictographic writing of the Indus Valley was found on seals, seal impressions, bronze and copper tables, pottery, bronze tools, bones, and other objects. The script may have been used as amulets, talismans, or identification markers. It is believed to have had an administrative function, used to record transactions. Clay tablets with the script were found in the Mesopotamia region, suggesting trade connections.",
      "error": false
    },
    {
      "summary": "Around 400 signs of the Indus script have been identified, with 31 signs repeated over 100 times. Researchers believe a large amount of the script was written on perishable materials such as palm leaves and bamboo sticks, which did not survive. Some researchers suggest that the 400 signs can be made of 39 elementary signs, with the rest being variations. Despite being undeciphered, the script is important as it is the only evidence of the Indus Valley civilization.",
      "error": false
    }
  ]
]